Repository: rizasghari/coffeeshop_flutter
Catalog: lib/localization/l10n/app_*.arb
Languages: ar

# splashTitle
source: Fall in Love with Coffee in Blissful Delight!
ar: من دواعي سروري أن تقع في حب القهوة!

# splashDescription
source: Welcome to our cozy coffee corner, where every cup is a delightful for you.
ar: مرحبًا بك في ركن القهوة المريح لدينا، حيث يمثل كل كوب متعة مختلفة بالنسبة لك.

# splashButton
source: Get Started
ar: يبدأ

# bottomNavItemHome
source: Home
ar: الرئيسية

# bottomNavItemFavourites
source: Favourites
ar: المفضلة

# bottomNavItemCart
source: Cart
ar: السلة

# bottomNavItemNotifications
source: Notifications
ar: الاشعارات

# homeTopLocationLabel
source: Location
ar: الموقع

# homeTopLocationHint
source: Bilzen, Tanjungbalai
ar: الامارات مترين، تنجينا

# homeTopSearchHint
source: Search coffee...
ar: ابحث عن قهوة...

# homeTopBannerBadge
source: Promo
ar: عروض

# homeTopBannerTextLine1
source: Buy one get
ar: اشتري واحدة واحصل

# homeTopBannerTextLine2
source: one FREE
ar: على واحدة مجانا

# itemDetailsTitle
source: Details
ar: تفاصيل

# itemDetailsPriceLabel
source: Price
ar: السعر

# itemDetailsBuyNow
source: Buy Now
ar: اشتري الان

# itemDetailsItemTitle
source: Caffe Mocha
ar: قهوة كافيه

# itemDetailsItemType
source: Ice/Hot
ar: مجانية

# itemDetailsItemDescriptionTitle
source: Description
ar: الوصف

# itemDetailsDescription
source: Cappuccino is a beloved coffee drink that originated in Italy and is traditionally part of the Italian breakfast. The name "cappuccino" comes from the Capuchin friars, referencing the color of their robes. It is crafted with equal parts of espresso, steamed milk, and milk froth, making it distinctive with its rich flavor and luxurious texture. A well-made cappuccino boasts a strong espresso base and is topped with a cloud-like layer of frothy steamed milk, often artistically presented with latte art. The drink is usually sprinkled with a dash of cocoa powder or cinnamon, enhancing its deep and invigorating aroma. Cappuccino has evolved and adapted with coffee culture over the years and around the world. While it remains a morning staple in Italy, in other parts of the world it is enjoyed throughout the day. The preparation of a cappuccino is considered an art form, requiring skill to achieve the perfect balance of espresso and the creamy froth. It is more than just a beverage; it's a symbol of coffee craftsmanship and culture, embodying the passion and precision that good coffee making demands. In cafes and kitchens alike, the cappuccino continues to be a central part of coffee lovers' routines, celebrated for its delightful taste and energizing effect.
ar: ChatGPT الكابتشينو هو مشروب قهوة محبوب يعود أصله إلى إيطاليا وهو تقليدياً جزء من الإفطار الإيطالي. يأتي اسم "كابتشينو" من رهبان الكابوتشين، ويشير إلى لون أرديةهم. يتم تحضيره بمقادير متساوية من الإسبريسو والحليب المبخر ورغوة الحليب، مما يجعله مميزًا بنكهته الغنية وملمسه الفاخر. يتميز الكابتشينو الجيد بقاعدة إسبريسو قوية ويعلوه طبقة سحابية من رغوة الحليب المبخر، وغالبًا ما يقدم بفن اللاتيه الجميل. عادة ما يُرش المشروب بقليل من بودرة الكاكاو أو القرفة، مما يعزز من رائحته العميقة والمنعشة. تطور الكابتشينو وتكيف مع ثقافة القهوة على مر السنين وحول العالم. بينما لا يزال يُعتبر مشروب الصباح في إيطاليا، في أجزاء أخرى من العالم يُستمتع به طوال اليوم. يُعتبر تحضير الكابتشينو فنًا يتطلب مهارة لتحقيق التوازن المثالي بين الإسبريسو والرغوة الكريمية. إنه أكثر من مجرد مشروب؛ إنه رمز لحرفية صنع القهوة وثقافتها، مما يجسد الشغف والدقة التي تتطلبها صناعة القهوة الجيدة. في المقاهي والمطابخ على حد سواء، يظل الكابتشينو جزءًا أساسيًا من روتين محبي القهوة، ويُحتفى به لطعمه اللذيذ وتأثيره المنشط.
